### Списки:

# 1. **Робота із списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.

list_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
list_numbers.append(10)
list_numbers.append(20)
list_numbers.remove(10)
print(list_numbers)


# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

list_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
sum_of_numbers = 0
for i in list_numbers:
    sum_of_numbers += i
print(sum_of_numbers)


# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.

list_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
for i in range(len(list_numbers)):
    list_numbers[i] *= 2
print(list_numbers)


# ### Кортежі:
# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.

mobile_phones = ('Iphone', 'Samsung', 'Motorola',)
for phone in mobile_phones:
    print(phone)


# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.

number_1 = (1, 2, 3, 4, 5, 6,)
number_2 = (11, 12, 13, 14,)
number_3 = number_1 + number_2


# ### Словники:
#
# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

my_favorite_athlete = {'name': 'Oleksandr', 'age': 41, 'sport': 'box', 'team': 'Usyk-team'}
for key, value in my_favorite_athlete.items():
    print(f'{key}: {value}')


# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.

my_favorite_books = {'Witcher': '2008', 'Зброя, мікроби і сталь': '2010'}
my_favorite_books['Будь найкращою версією себе'] = '2012'
print(my_favorite_books)


# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

capitals = {'Ukraine': 'Kyiv', 'Poland': 'Warsaw', 'USA': 'Washington', 'Spain': 'Madrid'}
country = input('Введіть будь ласка назву країни: ')
for key, value in capitals.items():
    if key == country:
        print(value)


# Завершіть кожне завдання, використовуючи вбудовані методи для списків, кортежів та словників. Бажаю успіхів у виконанні цих завдань!