import utilities

# **Завдання 2: Створення та імпорт власних модулів**
# Створіть власний Python-модуль з ім'ям `utilities.py`.
# Після створення цього модуля, створіть інший Python-файл (наприклад, `main.py`), який імпортує модуль `utilities.py` і використовує його функції для обробки списку чисел.

# В `main.py` створіть список чисел та використовуйте функції з модуля `utilities` для знаходження середнього значення та найбільшого числа у списку. Виведіть результати на екран.

list_numbers = [1, 2, 37, 4, 25, 6, 7, 8, 300, 10, 20, 30, 40, 99, 100, 150]

print(utilities.find_max(list_numbers))
print(utilities.calculate_average(list_numbers))
